R = 2
x0 = -10
x1 = 9
dx = 1
print('-' * 47)
print('{:<1} {:<20} {:<1} {:<20} {:<1}'.format('|', 'x', '|', 'y', '|'))
print('-' * 47)
while x0 != x1:
    if -10 <= x0 <= -6:
        y = ((R ** 2 - (x0 + 8) ** 2) ** 0.5) - 2
    elif -6 < x0 <= 2:
        y = 0.5 * x0 + 1
    elif 2 < x0 < 6:
        y = 0
    elif 6 <= x0 <= 8:
        y = (x0 - 6) ** 2
    else:
        print("Неверное значение x")
    print('{:<1} {:<20} {:<1} {:<20} {:<1}'.format('|', x0, '|', y, '|'))
    print('-' * 47)
    x0 += dx
